Repository: cgwalters/libpwquality-git
Catalog: po/*.po
Languages: fr

source: New %s%spassword:
fr: Nouveau %s%smot de passe :

source: Retype new %s%spassword:
fr: Retapez le nouveau %s%smot de passe :

source: Sorry, passwords do not match.
fr: Les mots de passe ne correspondent pas.

source: BAD PASSWORD: %s
fr: MOT DE PASSE INCORRECT : %s

source: The command reads the password to be scored from the standard input.
fr: La commande lit le mot de passe qui doit être marqué à partir de l'entrée standard.

source: Error: %s
fr: Erreur: %s

source: Could not obtain the password to be scored
fr: Impossible d'obtenir le mot de passe qui doit être marqué

source: Password quality check failed: %s
fr: Echec de la vérification de la qualité du mot de passe: %s

source: Memory allocation error when setting
fr: Erreur d'allocation de la mémoire pendant la configuration

source: Memory allocation error
fr: Erreur d'allocation de mémoire

source: The password is the same as the old one
fr: Le mot de passe est le même que l'ancien

source: The password is a palindrome
fr: Le mot de passe est un palindrome

source: The password differs with case changes only
fr: Le mot de passe diffère avec la casse seulement

source: The password is too similar to the old one
fr: Le mot de passe est très similaire à l'ancien

source: The password contains the user name in some form
fr: Le mot de passe contient le nom d'utilisateur sous une forme

source: The password contains words from the real name of the user in some form
fr: Le mot de passe contient des mots appartenant au nom réel de l'utilisateur sous une forme

source: The password contains forbidden words in some form
fr: Le mot de passe contient des mots interdits sous une forme

source: The password contains less than %ld digits
fr: Le mot de passe contient moins de %ld chiffres

source: The password contains too few digits
fr: Le mot de passe contient peu de chiffres

source: The password contains less than %ld uppercase letters
fr: Le mot de passe contient moins de %ld lettres en majuscule

source: The password contains too few uppercase letters
fr: Le mot de passe contient peu de lettres en majuscule

source: The password contains less than %ld lowercase letters
fr: Le mot de passe contient moins de %ld lettres en minuscule

source: The password contains too few lowercase letters
fr: Le mot de passe contient peu de lettres en minuscule

source: The password contains less than %ld non-alphanumeric characters
fr: Le mot de passe contient moins de %ld caractères non-alphanumériques

source: The password contains too few non-alphanumeric characters
fr: Le mot de passe contient peu de caractères non-alphanumériques

source: The password is shorter than %ld characters
fr: Le mot de passe est court de %ld caractères

source: The password is too short
fr: Le mot de passe est très court

source: The password is just rotated old one
fr: Le mot de passe est juste l'ancien roté

source: The password contains less than %ld character classes
fr: Le mot de passe contient moins de %ld classes de caractères

source: The password does not contain enough character classes
fr: Le mot de passe ne contient pas assez de classes de caractères

source: The password contains more than %ld same characters consecutively
fr: Le mot de passe contient plus de %ld caractères similaires consécutifs

source: The password contains too many same characters consecutively
fr: Le mot de passe contient trop de caractères similaires consécutifs

source: The password contains more than %ld characters of the same class consecutively
fr: Le mot de passe contient plus de %ld caractères de la même classe consécutivement

source: The password contains too many characters of the same class consecutively
fr: Le mot de passe contient beaucoup de caractères de la même classe consécutivement

source: No password supplied
fr: Aucun mot de passe fourni

source: Cannot obtain random numbers from the RNG device
fr: Impossible d'obtenir des nombres au hasard à partir de l'appareil RNG

source: Password generation failed - required entropy too low for settings
fr: Echec de génération de mot de passe - entropie nécessaire trop faible pour les paramètres

source: The password fails the dictionary check
fr: Le mot de passe fait échouer la vérification du dictionnaire

source: Unknown setting
fr: Paramètre inconnu

source: Bad integer value of setting
fr: Valeur entière de paramètre erronée

source: Bad integer value
fr: Valeur entière erronée

source: Setting %s is not of integer type
fr: Paramètre %s n'est pas de type entier

source: Setting is not of integer type
fr: Paramètre n'est pas de type entier

source: Setting %s is not of string type
fr: Paramètre %s n'est pas de type chaîne de caractères

source: Setting is not of string type
fr: Paramètre n'est pas de type chaîne de caractères

source: Opening the configuration file failed
fr: Echec de l'ouverture du fichier de configuration

source: The configuration file is malformed
fr: Le fichier de configuration est incorrect

source: Fatal failure
fr: Erreur fatale

source: Unknown error
fr: Erreur inconnue
